# Cd Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Cd Property
SymbolTypeId Class See Also
---
Symbol cd, indicating unit Candelas.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Cd { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Cd As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Cd {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace